Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_repository_file.this["ecosystem-directory/.github/workflows/stale.yml"] must be replaced
-/+ resource "github_repository_file" "this" {
      ~ branch              = "develop" -> "main" # forces replacement
      ~ commit_author       = "GitHub" -> (known after apply)
      ~ commit_email        = "noreply@github.com" -> (known after apply)
      ~ commit_sha          = "d40c860f07414168f691f9b5ee427867c3d49d87" -> (known after apply)
      ~ id                  = "ecosystem-directory/.github/workflows/stale.yml" -> (known after apply)
      ~ sha                 = "6f6d895d19361a0219079a97d8eb216f5d9e66a1" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # github_team_membership.this["Specs Stewards:Stebalien"] will be updated in-place
  ~ resource "github_team_membership" "this" {
        id       = "6237620:Stebalien"
      ~ role     = "maintainer" -> "member"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.this["Specs Stewards:darobin"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "6237620"
      + username = "darobin"
    }

  # github_team_membership.this["Specs Stewards:marten-seemann"] will be destroyed
  # (because key ["Specs Stewards:marten-seemann"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"2b7606b21e6b1e565fff524146e9cc0efec71a4f3e994a3d61641d6fab583a94\"" -> null
      - id       = "6237620:marten-seemann" -> null
      - role     = "member" -> null
      - team_id  = "6237620" -> null
      - username = "marten-seemann" -> null
    }

  # github_team_membership.this["Specs Stewards:petar"] will be destroyed
  # (because key ["Specs Stewards:petar"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"aecfaa987e98c698e67f87a554cec1a0e457fffa563968f6f32a9101c91d4dd7\"" -> null
      - id       = "6237620:petar" -> null
      - role     = "member" -> null
      - team_id  = "6237620" -> null
      - username = "petar" -> null
    }

Plan: 2 to add, 1 to change, 3 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->